Revit 2027 API
ParameterTypeId.RoofCurveHeightOffset Property
 "Offset From Roof Base"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RoofCurveHeightOffset { get; }
Public Shared ReadOnly Property RoofCurveHeightOffset As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RoofCurveHeightOffset {
	ForgeTypeId^ get ();
}
static member RoofCurveHeightOffset : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace